###########################################
# Created by NetGen (author: Daeyeon Kim) #
###########################################

set sdc_version 2.1

create_clock [get_ports clk] -period 200.000000 -name clk
set_input_delay -max 0.000000 [get_ports in0] -clock clk
set_input_delay -max 0.000000 [get_ports in1] -clock clk
set_input_delay -max 0.000000 [get_ports in2] -clock clk
set_input_delay -max 0.000000 [get_ports in3] -clock clk
set_input_delay -max 0.000000 [get_ports in4] -clock clk
set_input_delay -max 0.000000 [get_ports in5] -clock clk
set_input_delay -max 0.000000 [get_ports in6] -clock clk
set_input_delay -max 0.000000 [get_ports in7] -clock clk
set_input_delay -max 0.000000 [get_ports in8] -clock clk
set_input_delay -max 0.000000 [get_ports in9] -clock clk
set_input_delay -max 0.000000 [get_ports in10] -clock clk
set_input_delay -max 0.000000 [get_ports in11] -clock clk
set_input_delay -max 0.000000 [get_ports in12] -clock clk
set_input_delay -max 0.000000 [get_ports in13] -clock clk
set_input_delay -max 0.000000 [get_ports in14] -clock clk
set_input_delay -max 0.000000 [get_ports in15] -clock clk
set_input_delay -max 0.000000 [get_ports in16] -clock clk
set_input_delay -max 0.000000 [get_ports in17] -clock clk
set_input_delay -max 0.000000 [get_ports in18] -clock clk
set_input_delay -max 0.000000 [get_ports in19] -clock clk
set_input_delay -max 0.000000 [get_ports in20] -clock clk
set_input_delay -max 0.000000 [get_ports in21] -clock clk
set_input_delay -max 0.000000 [get_ports in22] -clock clk
set_input_delay -max 0.000000 [get_ports in23] -clock clk
set_input_delay -max 0.000000 [get_ports in24] -clock clk
set_input_delay -max 0.000000 [get_ports in25] -clock clk
set_input_delay -max 0.000000 [get_ports in26] -clock clk
set_input_delay -max 0.000000 [get_ports in27] -clock clk
set_input_delay -max 0.000000 [get_ports in28] -clock clk
set_input_delay -max 0.000000 [get_ports in29] -clock clk
set_input_delay -max 0.000000 [get_ports in30] -clock clk
set_input_delay -max 0.000000 [get_ports in31] -clock clk
set_input_delay -max 0.000000 [get_ports in32] -clock clk
set_input_delay -max 0.000000 [get_ports in33] -clock clk
set_input_delay -max 0.000000 [get_ports in34] -clock clk
set_input_delay -max 0.000000 [get_ports in35] -clock clk
set_input_delay -max 0.000000 [get_ports in36] -clock clk
set_input_delay -max 0.000000 [get_ports in37] -clock clk
set_input_delay -max 0.000000 [get_ports in38] -clock clk
set_input_delay -max 0.000000 [get_ports in39] -clock clk
set_input_delay -max 0.000000 [get_ports in40] -clock clk
set_input_delay -max 0.000000 [get_ports in41] -clock clk
set_input_delay -max 0.000000 [get_ports in42] -clock clk
set_input_delay -max 0.000000 [get_ports in43] -clock clk
set_input_delay -max 0.000000 [get_ports in44] -clock clk
set_input_delay -max 0.000000 [get_ports in45] -clock clk
set_input_delay -max 0.000000 [get_ports in46] -clock clk
set_input_delay -max 0.000000 [get_ports in47] -clock clk
set_input_delay -max 0.000000 [get_ports in48] -clock clk
set_input_delay -max 0.000000 [get_ports in49] -clock clk
set_input_delay -max 0.000000 [get_ports in50] -clock clk
set_input_delay -max 0.000000 [get_ports in51] -clock clk
set_input_delay -max 0.000000 [get_ports rst] -clock clk
set_output_delay -max 0.000000 [get_ports out0] -clock clk
set_output_delay -max 0.000000 [get_ports out1] -clock clk
set_output_delay -max 0.000000 [get_ports out2] -clock clk
set_output_delay -max 0.000000 [get_ports out3] -clock clk
set_output_delay -max 0.000000 [get_ports out4] -clock clk
set_output_delay -max 0.000000 [get_ports out5] -clock clk
set_output_delay -max 0.000000 [get_ports out6] -clock clk
set_output_delay -max 0.000000 [get_ports out7] -clock clk
set_output_delay -max 0.000000 [get_ports out8] -clock clk
set_output_delay -max 0.000000 [get_ports out9] -clock clk
set_output_delay -max 0.000000 [get_ports out10] -clock clk
set_output_delay -max 0.000000 [get_ports out11] -clock clk
set_output_delay -max 0.000000 [get_ports out12] -clock clk
set_output_delay -max 0.000000 [get_ports out13] -clock clk
set_output_delay -max 0.000000 [get_ports out14] -clock clk
set_output_delay -max 0.000000 [get_ports out15] -clock clk
set_output_delay -max 0.000000 [get_ports out16] -clock clk
set_output_delay -max 0.000000 [get_ports out17] -clock clk
set_output_delay -max 0.000000 [get_ports out18] -clock clk
set_output_delay -max 0.000000 [get_ports out19] -clock clk
set_output_delay -max 0.000000 [get_ports out20] -clock clk
set_output_delay -max 0.000000 [get_ports out21] -clock clk
set_output_delay -max 0.000000 [get_ports out22] -clock clk
set_output_delay -max 0.000000 [get_ports out23] -clock clk
set_output_delay -max 0.000000 [get_ports out24] -clock clk
set_output_delay -max 0.000000 [get_ports out25] -clock clk
set_output_delay -max 0.000000 [get_ports out26] -clock clk
set_output_delay -max 0.000000 [get_ports out27] -clock clk
set_output_delay -max 0.000000 [get_ports out28] -clock clk
set_output_delay -max 0.000000 [get_ports out29] -clock clk
set_output_delay -max 0.000000 [get_ports out30] -clock clk
set_output_delay -max 0.000000 [get_ports out31] -clock clk
set_output_delay -max 0.000000 [get_ports out32] -clock clk
set_output_delay -max 0.000000 [get_ports out33] -clock clk
set_output_delay -max 0.000000 [get_ports out34] -clock clk
set_output_delay -max 0.000000 [get_ports out35] -clock clk
set_output_delay -max 0.000000 [get_ports out36] -clock clk
set_output_delay -max 0.000000 [get_ports out37] -clock clk
set_output_delay -max 0.000000 [get_ports out38] -clock clk
set_output_delay -max 0.000000 [get_ports out39] -clock clk
set_output_delay -max 0.000000 [get_ports out40] -clock clk
set_output_delay -max 0.000000 [get_ports out41] -clock clk
set_output_delay -max 0.000000 [get_ports out42] -clock clk
set_output_delay -max 0.000000 [get_ports out43] -clock clk
set_output_delay -max 0.000000 [get_ports out44] -clock clk
set_output_delay -max 0.000000 [get_ports out45] -clock clk
set_output_delay -max 0.000000 [get_ports out46] -clock clk
set_output_delay -max 0.000000 [get_ports out47] -clock clk
set_output_delay -max 0.000000 [get_ports out48] -clock clk
set_output_delay -max 0.000000 [get_ports out49] -clock clk
set_output_delay -max 0.000000 [get_ports out50] -clock clk
set_output_delay -max 0.000000 [get_ports out51] -clock clk
