###############################################################################
# Created by write_sdc
###############################################################################
current_design netlist_2
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 8.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in0}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in1}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in10}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in11}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in12}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in13}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in14}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in15}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in16}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in17}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in18}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in19}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in2}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in20}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in21}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in22}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in23}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in24}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in25}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in26}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in27}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in28}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in29}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in3}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in30}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in31}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in32}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in33}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in34}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in35}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in36}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in37}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in38}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in39}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in4}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in40}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in41}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in42}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in43}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in44}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in45}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in46}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in47}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in48}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in49}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in5}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in50}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in51}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in6}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in7}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in8}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {in9}]
set_input_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out0}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out1}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out10}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out11}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out12}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out13}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out14}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out15}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out16}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out17}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out18}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out19}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out2}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out20}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out21}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out22}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out23}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out24}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out25}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out26}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out27}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out28}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out29}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out3}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out30}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out31}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out32}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out33}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out34}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out35}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out36}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out37}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out38}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out39}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out4}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out40}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out41}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out42}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out43}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out44}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out45}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out46}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out47}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out48}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out49}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out5}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out50}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out51}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out6}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out7}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out8}]
set_output_delay 1.6000 -clock [get_clocks {clk}] -add_delay [get_ports {out9}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {out0}]
set_load -pin_load 0.0334 [get_ports {out1}]
set_load -pin_load 0.0334 [get_ports {out10}]
set_load -pin_load 0.0334 [get_ports {out11}]
set_load -pin_load 0.0334 [get_ports {out12}]
set_load -pin_load 0.0334 [get_ports {out13}]
set_load -pin_load 0.0334 [get_ports {out14}]
set_load -pin_load 0.0334 [get_ports {out15}]
set_load -pin_load 0.0334 [get_ports {out16}]
set_load -pin_load 0.0334 [get_ports {out17}]
set_load -pin_load 0.0334 [get_ports {out18}]
set_load -pin_load 0.0334 [get_ports {out19}]
set_load -pin_load 0.0334 [get_ports {out2}]
set_load -pin_load 0.0334 [get_ports {out20}]
set_load -pin_load 0.0334 [get_ports {out21}]
set_load -pin_load 0.0334 [get_ports {out22}]
set_load -pin_load 0.0334 [get_ports {out23}]
set_load -pin_load 0.0334 [get_ports {out24}]
set_load -pin_load 0.0334 [get_ports {out25}]
set_load -pin_load 0.0334 [get_ports {out26}]
set_load -pin_load 0.0334 [get_ports {out27}]
set_load -pin_load 0.0334 [get_ports {out28}]
set_load -pin_load 0.0334 [get_ports {out29}]
set_load -pin_load 0.0334 [get_ports {out3}]
set_load -pin_load 0.0334 [get_ports {out30}]
set_load -pin_load 0.0334 [get_ports {out31}]
set_load -pin_load 0.0334 [get_ports {out32}]
set_load -pin_load 0.0334 [get_ports {out33}]
set_load -pin_load 0.0334 [get_ports {out34}]
set_load -pin_load 0.0334 [get_ports {out35}]
set_load -pin_load 0.0334 [get_ports {out36}]
set_load -pin_load 0.0334 [get_ports {out37}]
set_load -pin_load 0.0334 [get_ports {out38}]
set_load -pin_load 0.0334 [get_ports {out39}]
set_load -pin_load 0.0334 [get_ports {out4}]
set_load -pin_load 0.0334 [get_ports {out40}]
set_load -pin_load 0.0334 [get_ports {out41}]
set_load -pin_load 0.0334 [get_ports {out42}]
set_load -pin_load 0.0334 [get_ports {out43}]
set_load -pin_load 0.0334 [get_ports {out44}]
set_load -pin_load 0.0334 [get_ports {out45}]
set_load -pin_load 0.0334 [get_ports {out46}]
set_load -pin_load 0.0334 [get_ports {out47}]
set_load -pin_load 0.0334 [get_ports {out48}]
set_load -pin_load 0.0334 [get_ports {out49}]
set_load -pin_load 0.0334 [get_ports {out5}]
set_load -pin_load 0.0334 [get_ports {out50}]
set_load -pin_load 0.0334 [get_ports {out51}]
set_load -pin_load 0.0334 [get_ports {out6}]
set_load -pin_load 0.0334 [get_ports {out7}]
set_load -pin_load 0.0334 [get_ports {out8}]
set_load -pin_load 0.0334 [get_ports {out9}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in10}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in11}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in12}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in13}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in14}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in15}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in16}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in17}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in18}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in19}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in20}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in21}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in22}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in23}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in24}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in25}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in26}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in27}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in28}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in29}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in3}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in30}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in31}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in32}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in33}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in34}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in35}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in36}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in37}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in38}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in39}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in4}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in40}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in41}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in42}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in43}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in44}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in45}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in46}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in47}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in48}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in49}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in5}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in50}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in51}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in6}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in7}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in8}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {in9}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
